requisições/req_2026-02-26T14-32-28-118Z_SaveRecord.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>GlbConsSqlData</tot:DataServerName>
         <!--Optional:-->
         <tot:XML><![CDATA[<GlbConsSql>
  <GConsSql>
    <CODCOLIGADA>1</CODCOLIGADA>
    <APLICACAO>T</APLICACAO>
    <CODSENTENCA>SIT.PORTALRM.019</CODSENTENCA>
    <TITULO>Retorna Lançamentos Contas a Receber</TITULO>
    <SENTENCA>select *
from flan f
left join fcfo fo
on f.codcolcfo = fo.codcoligada and f.codcfo = fo.codcfo
where f.pagrec = 1</SENTENCA>
    <TAMANHO>114</TAMANHO>
    <DTULTALTERACAO>2026-02-26T11:32:28.0000000-03:00</DTULTALTERACAO>
    <USRULTALTERACAO>mestre</USRULTALTERACAO>
    <DISPONIVELFILTRO>1</DISPONIVELFILTRO>
    <DISPONIVELRELATORIO>1</DISPONIVELRELATORIO>
    <DISPONIVELVISAO>1</DISPONIVELVISAO>
    <DISPONIVELMENU>0</DISPONIVELMENU>
    <SEMSEGCOLUNAS>0</SEMSEGCOLUNAS>
    <SEMSEGESTENDIDA>0</SEMSEGESTENDIDA>
    <GUID>58681419-db85-4db6-b39e-980ce023eab7</GUID>
    <CONTROLE>50837</CONTROLE>
  </GConsSql>
</GlbConsSql>]]></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODCOLIGADA=1;CODUSUARIO='mestre';CODSISTEMA=T</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>